-- =========================================
-- Задания на дом по SQL
-- Студент: (Ахмедов Эмир Энверович)
-- Вариант: 20
-- Дата: 29.09.2026
-- =========================================

-- Задание 1. Самый дорогой товар
-- Условие: выведите название и цену самого дорогого товара.
SELECT название, цена FROM Товар ORDER BY цена DESC LIMIT 1;

-- Задание 2. Самый дешёвый товар
-- Условие: выведите название и цену самого дешёвого товара.
SELECT название, цена FROM Товар ORDER BY цена ASC LIMIT 1;

-- Задание 3. Товары одной категории
-- Условие: выведите название и цену товаров в категории (замените 'Электроника' на вашу категорию)
SELECT название, цена FROM Товар WHERE категория = 'Второе';

-- Задание 4. Поиск по названию
-- Условие: найдите все товары, в названии которых есть буква «о».
SELECT * FROM Товар WHERE название LIKE '%о%';

-- Задание 5. Все заказы
-- Условие: выведите все заказы: id, дата, клиент, товар_id, количество.
SELECT id, дата, клиент, товар_id, количество FROM Заказ;

-- Задание 6. Заказы конкретного клиента
-- Условие: выведите все заказы клиента «Иванов Иван Иванович».
SELECT * FROM Заказ WHERE клиент = 'Иванов Иван Иванович';

-- Задание 7. JOIN — заказы с названиями товаров
-- Условие: выведите: дата, клиент, название товара, количество.
SELECT Заказ.дата, Заказ.клиент, Товар.название, Заказ.количество
FROM Заказ
JOIN Товар ON Заказ.товар_id = Товар.id;

-- Задание 8. Общая сумма всех заказов
-- Условие: посчитайте итоговую сумму всех заказов: Товар.цена × Заказ.количество.
SELECT SUM(Товар.цена * Заказ.количество)
FROM Заказ
JOIN Товар ON Заказ.товар_id = Товар.id;


-- Задание 9. Количество заказов по клиентам
-- Условие: для каждого клиента посчитайте, сколько у него заказов.
SELECT клиент, COUNT(*) AS количество_заказов
FROM Заказ
GROUP BY клиент;

-- Задание 10. Свой запрос
-- Что хочу получить: Список всех товаров, которые стоят дешевле 1000 рублей
SELECT название, цена FROM Товар WHERE цена < 350;
